# AncillaryExists Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..AncillaryExists Method
FabricationConfiguration Class See Also
---
Checks to see if the specified ancillary exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool AncillaryExists(
	int ancillaryId
)
```

Visual Basic
---
```text
Public Function AncillaryExists ( _
	ancillaryId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool AncillaryExists(
	int ancillaryId
)
```

# ### Parameters
ancillaryId
    Type: System..::..Int32 The ancillary identifier.
# ### Return Value
Returns true if the ancillary exists.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace